azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v8/Regression Tests/CreateUpdate Type I/Update.bru

meta {
  name: Update
  type: http
  seq: 2
}

post {
  url: {{create-or-update-individual-v8-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v8/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
       <soapenv:Body>
      <ns2:CreateUpdateIndividualRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd"
          xmlns:ns5="http://www.af-klm.com/services/passenger/request-v8/xsd"
          xmlns:ns8="http://www.af-klm.com/services/passenger/SicOsirisType-v1/xsd"
          xmlns:ns7="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd"
          xmlns:ns2="http://www.af-klm.com/services/passenger/data-v8/xsd"
          xmlns:ns4="http://www.af-klm.com/services/passenger/response-v8/xsd"
          xmlns:ns3="http://www.af-klm.com/services/passenger/SicIndividuType-v3/xsd">
     
          <requestor>
              <channel>B2C</channel>
              <site>QVI</site>
              <signature>REGRESSION</signature>
          </requestor>
          <individualRequest>
              <individualInformations>
                  <identifier>{{gin_create}}</identifier>
                  <birthDate>2000-01-01T00:00:00Z</birthDate>
              </individualInformations>
          </individualRequest>
      </ns2:CreateUpdateIndividualRequestElement>
  </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
}

vars:post-response {
  gin_create: null
}

assert {
  res.status: eq 200
}
